content/html/meeting-notes/2012-04-03.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Meeting Notes 2012-04-03</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Meeting Notes 2012-04-03"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-25 22:11:24 EDT"/>
<meta name="author" content="Matthew Croop"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Meeting Notes 2012-04-03</h1>


<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-30426956-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Setup</a></li>
<li><a href="#sec-2">Tutorial (Reprise)</a></li>
<li><a href="#sec-3">Flymake</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Setup</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>Mish put Google Analytics up last week. We've already gotten three
    visitors from Zurich.
</li>
<li>Special thanks to Michael S., who accidentally left his
    (working!) power strip in the room.
</li>
<li>A diagram of Todun's 555 project is on the whiteboard.
<ul>
<li>The databases were once cylinders, as is traditional, but the need for
      more writing space transformed them into conical frusta.
</li>
</ul>

</li>
<li>The Box O' Sandwiches arrives, carried by John, Mish, and Rafe.
</li>
<li>Zach and John discuss matters of the Haskell.
<ul>
<li>Rafe complains about lack of purity in purity restrictions.
</li>
<li><b>Mish</b>: These kids are Haskelling it up.
</li>
</ul>

</li>
<li>Happy birthday John!
<ul>
<li><code>M-x animate-birthday-present</code>
</li>
<li>The birthday present is martini-swan-dived, then dissociated.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Tutorial (Reprise)</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>We're all eating, so Mish does an Emacs tutorial.
</li>
<li><b>Mish</b>: It assumes you're smart, so that'll help.
</li>
<li><b>Mish</b>: Emacs is self-documenting. That's what makes it better
    than all the other editors.
</li>
<li>In the midst of his presentation, Mish is chatted at.
<ul>
<li><b>Lucy</b>: MISH
</li>
<li><b>Lucy</b>: CAN ALL OF MY BEST FRIENDS AT PENN JUST HANG OUT AT ONE PLACE
</li>
</ul>

</li>
<li><b>Mish</b>: Up down left right those let you move around. You can
    also use C-f C-b C-n C-p.
<ul>
<li><code>C-p C-p C-n C-n C-b C-f C-b C-f b a</code>
</li>
</ul>

</li>
<li>Mish cascades frame-splitting infinitely.
<ul>
<li><b>Rafe</b>: I don't believe you can actually go infinitely.
</li>
</ul>

</li>
<li>He then cycles through the frames.
<ul>
<li><b>Mish</b>: The order is top to bottom, left to right.
</li>
<li><b>Andrew</b>: Really? I always thought it was just random.
</li>
</ul>

</li>
<li>Finally, he kills the buffers.
<ul>
<li><code>C-x C-b C-x o d d x y y</code>
</li>
<li><b>Mish</b>: The buffer displaying the buffers is also a buffer, and
      I can kill it too. 
</li>
<li><b>Rafe</b>: That's mean.
</li>
</ul>

</li>
<li><b>Mish</b>: <code>M-x shell</code> is cool and handy if you never want to leave
    emacs. You should never want to leave emacs.
</li>
</ul>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Flymake</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>We browse the java flymake docs. Rafe didn't know that java had
    lint built in.
<ul>
<li><b>Rafe</b>: I'll run it on one of my students' files, see what kind
      of output we get.
</li>
<li><b>man javac</b>: -Xlint Enable all recommended warnings. In this release,
      all available warnings are recommended.
</li>
<li>This isn't actually lint. This is disappointing.
</li>
</ul>

</li>
<li>yasnippit autocompletes <code>defun</code> for Mish. He tabs to the docstring line.
<ul>
<li><b>Andrew</b>: You can just leave it blank.
</li>
<li><b>Rafe</b>: No, that breaks the invariant of emacs being all
      self-documenting.
</li>
</ul>

</li>
<li>Next week will include code style checking.
<ul>
<li><b>Zach</b>: All the cool kids are checking their styles.
</li>
</ul>

</li>
<li>John raises the blinds, singing the theme from 2001.
</li>
<li>An hour later, Mish retrieves his dongle.
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-25 22:11:24 EDT</p>
<p class="author">Author: Matthew Croop</p>
<p class="creator">Org version 7.8.09 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
